backend/modules/product/controllers/ProductController.php

SELECT `id`, `root`, `name` FROM `product_category` WHERE `level`=0
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $model->category3_id = 4;
        $model->category2_id = 33;
        $category = ProductCategory::find()->select(['id','root', 'name'])->where(['level'=>0])->indexBy('id')->all();