backend/modules/product/controllers/ProductController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        $categoryInfo = ProductCategory::find()->where(['id'=>$model->category_id])->asArray()->one();
        $categoryPath = ProductCategory::find()
            ->where(['<','lft',$categoryInfo['lft']])
            ->andWhere(['>','rgt',$categoryInfo['rgt']])
            ->andWhere(['root' => $categoryInfo['root']])
            ->orderBy('lft')
            ->indexBy('id')
            ->asArray()
            ->all();
---
SELECT * FROM `product_category` WHERE `id`=44
SELECT * FROM `product_category` WHERE ((`lft` < '11') AND (`rgt` > '12')) AND (`root`='4') ORDER BY `lft`