backend/modules/product/controllers/ProductController.php

SELECT `id`, `lft`, `name` FROM `product_category` WHERE `level`=0
INSERT INTO `product` (`category_id`, `name`, `list_img`, `pro_img`, `info`, `content`, `created_at`) VALUES (40, 'ewgfdgfdg', '20161017/20161017145822_25072.png', '20161017/20161017145822_84609.png', 'dfgre', '<p>fh<br/></p>', 1476687502)
---
    public function actionCreate()
    {
        $model = new Product();
        $category = ProductCategory::find()->select(['id','lft', 'name'])->where(['level'=>0])->indexBy('id')->all();

        $data = Yii::$app->request->post();

        if($data)
        {
            //$data['Product']['parent_id2'] = $data['Product']['id'];
            //unset($data['Product']['id']);

            $picFile = Common::uploadFile('Product[pic]');
            unset($data['Product']['pic']);
            if($picFile) $data['Product']['pic'] = $picFile['path'];
            $data['Product']['supply'] = implode(',', $data['Product']['supply']);
            if ($model->load($data) && $model->save())

SELECT * FROM `product` WHERE `id`='6'
---
    protected function findModel($id)
    {
        if (($model = Product::findOne($id)) !== null) {