common/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['email' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`email`='234343@qq.com') AND (`status`='active')